cockroachLoadTest/prod/seedAptWithID.yml
# artillery run cockroachLoadTest/prod/seedAptWithID.yml

config:
  target: "http://ec2-54-209-75-211.compute-1.amazonaws.com"
  processor: "../generator.js"
  http: 10
  phases:
    - duration: 10
      arrivalRate: 100
  defaults:
    headers:
scenarios:
  - name: "register an apartment listing with incrementing ids"
    flow:
      - function: "generateApartmentDataId"
      - post:
          url: "/api/listingId"
          json:
            id: "{{id}}"
            price: "{{price}}"
            minStay: "{{minStay}}"
            stars: "{{stars}}"
            numRatings: "{{numRatings}}"
            max: "{{max}}"
      - log: "Sent a request to /api/listings with {{ id }}, {{ stars }}, {{ minStay }}"